In [109]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.svm import LinearSVC
from sklearn.metrics import confusion_matrix
import pickle

In [88]:
DFtrain = pd.read_csv(r'..\data\train.csv',index_col = 'PassengerId')

In [89]:
DFtrain

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [90]:
DFtrain.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [91]:
DFtrain

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [92]:
DFtrain.drop(columns=['Cabin'],inplace=True,errors='ignore')
DFtrain.drop(columns=['Ticket'],inplace=True,errors='ignore')
DFtrain.drop(columns=['Name'],inplace=True,errors='ignore')
lb = LabelEncoder()
DFtrain.Embarked = lb.fit_transform(DFtrain.Embarked)
DFtrain.Sex = lb.fit_transform(DFtrain.Sex)

In [93]:
#Age to do
DFtrain.drop(columns=['Age'],inplace=True,errors='ignore')

In [94]:
lb.classes_

array(['female', 'male'], dtype=object)

In [95]:
DFtrain

             Survived  Pclass  Sex  SibSp  Parch     Fare  Embarked
PassengerId
1                   0       3    1      1      0   7.2500         2
2                   1       1    0      1      0  71.2833         0
3                   1       3    0      0      0   7.9250         2
4                   1       1    0      1      0  53.1000         2
5                   0       3    1      0      0   8.0500         2
...               ...     ...  ...    ...    ...      ...       ...
887                 0       2    1      0      0  13.0000         2
888                 1       1    0      0      0  30.0000         2
889                 0       3    0      1      2  23.4500         2
890                 1       1    1      0      0  30.0000         0
891                 0       3    1      0      0   7.7500         1

[891 rows x 7 columns]

In [96]:
DFX = DFtrain.iloc[:,1:]
DFY = DFtrain.iloc[:,0]

In [97]:
DFTrainX,DFValX ,DFtrainY,DFValY = train_test_split(DFX,DFY,shuffle=True)

In [100]:
model = LinearSVC()
model.fit(DFTrainX,DFtrainY)

C:\Users\NikhilR\AppData\Roaming\Python\Python38\site-packages\sklearn\svm\_base.py:985: ConvergenceWarning: Liblinear failed to converge, increase the number of iterations.
  warnings.warn("Liblinear failed to converge, increase "

LinearSVC()

In [116]:
DFTrainX

             Pclass  Sex  SibSp  Parch     Fare  Embarked
PassengerId
4                 1    0      1      0  53.1000         2
256               3    0      0      2  15.2458         0
225               1    1      1      0  90.0000         2
152               1    0      1      0  66.6000         2
642               1    0      0      0  69.3000         0
...             ...  ...    ...    ...      ...       ...
627               2    1      0      0  12.3500         1
543               3    0      4      2  31.2750         2
299               1    1      0      0  30.5000         2
112               3    0      1      0  14.4542         0
206               3    0      0      1  10.4625         2

[668 rows x 6 columns]

In [101]:
DFpredY = model.predict(DFValX)

In [108]:
confusion_matrix(DFValY,DFpredY)

array([[104,  30],
       [ 27,  62]], dtype=int64)

In [99]:
DFTrainX.isnull().sum()

Pclass      0
Sex         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [113]:
s = pickle.dumps(model)
type(s)

bytes

In [115]:
f = open('model.bin','wb')
f.write(s)
f.close()